xml/cc/single_user_full_rul.xml
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE tsung SYSTEM "/Users/stephen/src/tsung-wrapper/config/project/cc/tsung-1.0.dtd">
<tsung loglevel="debug" dumptraffic="protocol" version="1.0">
  <!-- Client Side Setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="9000"/>
  </clients>
  <!-- Server Side Setup -->
  <servers>
    <server host="test_server_host" port="3000" type="tcp"/>
  </servers>
  <load>
    <!-- Scenario 1: Single User -->
    <arrivalphase phase="1" duration="6" unit="second">
      <users maxnumber="1" arrivalrate="5" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <!-- Define User Agents -->
    <option type="ts_http" name="user_agent">
      <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
      <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>
  <sessions>
    <session name="full_run-20140522-150939" probability="100" type="ts_http">
      <!-- GET Landing Page -->
      <thinktime random="true" value="4"/>
      <request>
        <match do="abort" when="match" name="abort_unless_success_or_redirect">HTTP/1.1 [^2|^3][0-9]{2}</match>
        <http url="http://localhost:3000/" version="1.1" method="GET"/>
      </request>
      <!-- GET new -->
      <thinktime random="true" value="4"/>
      <request>
        <match do="abort" when="match" name="abort_unless_success_or_redirect">HTTP/1.1 [^2|^3][0-9]{2}</match>
        <dyn_variable name="csrf_token" re="&lt;meta content=&quot;(.*)&quot; name=&quot;csrf-token&quot; /&gt;"/>
        <http url="http://localhost:3000/new" version="1.1" method="GET"/>
      </request>
      <!-- POST new with my details -->
      <thinktime random="true" value="4"/>
      <request subst="true">
        <match do="abort" when="match" name="abort_unless_success_or_redirect">HTTP/1.1 [^2|^3][0-9]{2}</match>
        <http url="http://localhost:3000/submission" version="1.1" contents="utf8=%E2%9C%93&amp;authenticity_token=%%_csrf_token%%&amp;claim=%7B%22form_state%22%3D%3E%22form_state%22%2C+%22property%22%3D%3E%7B%22house%22%3D%3E%22Yes%22%2C+%22street%22%3D%3E%22Flat+34%5Cr%5Cn65+Finbourough+Road%5Cr%5CnLondon%22%2C+%22postcode%22%3D%3E%22SW10+9XX%22%7D%2C+%22claimant_one%22%3D%3E%7B%22title%22%3D%3E%22Mr%22%2C+%22full_name%22%3D%3E%22Stephen+Richards%22%2C+%22street%22%3D%3E%2250+Tregunter+Road%5Cr%5CnLondon%22%2C+%22postcode%22%3D%3E%22SW10+9LB%22%7D%2C+%22claimant_two%22%3D%3E%7B%22title%22%3D%3E%22%22%2C+%22full_name%22%3D%3E%22%22%2C+%22street%22%3D%3E%22%22%2C+%22postcode%22%3D%3E%22%22%7D%2C+%22claimant_contact%22%3D%3E%7B%22title%22%3D%3E%22%22%2C+%22full_name%22%3D%3E%22%22%2C+%22company_name%22%3D%3E%22%22%2C+%22street%22%3D%3E%22%22%2C+%22postcode%22%3D%3E%22%22%2C+%22email%22%3D%3E%22%22%2C+%22phone%22%3D%3E%22%22%2C+%22fax%22%3D%3E%22%22%2C+%22dx_number%22%3D%3E%22%22%7D%2C+%22defendant_one%22%3D%3E%7B%22title%22%3D%3E%22Mr%22%2C+%22full_name%22%3D%3E%22John+Doe%22%2C+%22street%22%3D%3E%22%22%2C+%22postcode%22%3D%3E%22%22%7D%2C+%22defendant_two%22%3D%3E%7B%22title%22%3D%3E%22%22%2C+%22full_name%22%3D%3E%22%22%2C+%22street%22%3D%3E%22%22%2C+%22postcode%22%3D%3E%22%22%7D%2C+%22tenancy%22%3D%3E%7B%22tenancy_type%22%3D%3E%22assured%22%2C+%22assured_shorthold_tenancy_type%22%3D%3E%22one%22%2C+%22start_date%283i%29%22%3D%3E%224%22%2C+%22start_date%282i%29%22%3D%3E%222%22%2C+%22start_date%281i%29%22%3D%3E%222012%22%2C+%22original_assured_shorthold_tenancy_agreement_date%283i%29%22%3D%3E%22%22%2C+%22original_assured_shorthold_tenancy_agreement_date%282i%29%22%3D%3E%22%22%2C+%22original_assured_shorthold_tenancy_agreement_date%281i%29%22%3D%3E%22%22%2C+%22latest_agreement_date%283i%29%22%3D%3E%22%22%2C+%22latest_agreement_date%282i%29%22%3D%3E%22%22%2C+%22latest_agreement_date%281i%29%22%3D%3E%22%22%2C+%22applicable_statements_1%22%3D%3E%22No%22%2C+%22applicable_statements_2%22%3D%3E%22No%22%2C+%22applicable_statements_3%22%3D%3E%22No%22%2C+%22applicable_statements_4%22%3D%3E%22No%22%2C+%22applicable_statements_5%22%3D%3E%22No%22%2C+%22assured_shorthold_tenancy_notice_served_by%22%3D%3E%22%22%2C+%22assured_shorthold_tenancy_notice_served_date%283i%29%22%3D%3E%22%22%2C+%22assured_shorthold_tenancy_notice_served_date%282i%29%22%3D%3E%22%22%2C+%22assured_shorthold_tenancy_notice_served_date%281i%29%22%3D%3E%22%22%2C+%22applicable_statements_6%22%3D%3E%22No%22%2C+%22demotion_order_date%283i%29%22%3D%3E%22%22%2C+%22demotion_order_date%282i%29%22%3D%3E%22%22%2C+%22demotion_order_date%281i%29%22%3D%3E%22%22%2C+%22demotion_order_court%22%3D%3E%22%22%7D%2C+%22notice%22%3D%3E%7B%22served_by_name%22%3D%3E%22Stephen+Richards%22%2C+%22served_method%22%3D%3E%22In+Person%22%2C+%22date_served%283i%29%22%3D%3E%2201%22%2C+%22date_served%282i%29%22%3D%3E%22jan%22%2C+%22date_served%281i%29%22%3D%3E%222014%22%2C+%22expiry_date%283i%29%22%3D%3E%2228%22%2C+%22expiry_date%282i%29%22%3D%3E%22feb%22%2C+%22expiry_date%281i%29%22%3D%3E%222014%22%7D%2C+%22license%22%3D%3E%7B%22multiple_occupation%22%3D%3E%22Yes%22%2C+%22issued_under_act_part%22%3D%3E%22Part2%22%2C+%22issued_by%22%3D%3E%22RBKC%22%2C+%22issued_date%283i%29%22%3D%3E%226%22%2C+%22issued_date%282i%29%22%3D%3E%226%22%2C+%22issued_date%281i%29%22%3D%3E%222011%22%7D%2C+%22deposit%22%3D%3E%7B%22received%22%3D%3E%22Yes%22%2C+%22as_money%22%3D%3E%22Yes%22%2C+%22as_property%22%3D%3E%22No%22%2C+%22ref_number%22%3D%3E%22TENDEP12212%22%7D%2C+%22order%22%3D%3E%7B%22possession%22%3D%3E%22Yes%22%2C+%22cost%22%3D%3E%22Yes%22%7D%2C+%22possession%22%3D%3E%7B%22hearing%22%3D%3E%22Yes%22%7D%2C+%22fee%22%3D%3E%7B%22court_fee%22%3D%3E%22280.00%22%7D%2C+%22legal_cost%22%3D%3E%7B%22legal_costs%22%3D%3E%22550.00%22%7D%2C+%22reference_number%22%3D%3E%7B%22reference_number%22%3D%3E%22PSR0133%22%7D%7D&amp;multiplePanelRadio_claimants=1&amp;multiplePanelRadio_defendants=1&amp;defendant1address=yes&amp;Complete+form=Complete+form&amp;ypos=6226" content_type="application/x-www-form-urlencoded" method="POST"/>
      </request>
    </session>
  </sessions>
</tsung>